Catalogs/ВнутренниеДоговоры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>ВнутренниеДоговоры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Предприятия</xr:Item>
				<xr:Item>Catalog.сабПредприятияХолдинга</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БухгалтерскийДоговор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияВладельца</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВнутренниеДоговоры/Forms/ФормаВыбора/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.ЗаполнятьОтборДляВНХ = Ложь;
	Список.Параметры.УстановитьЗначениеПараметра("ДоступныеПредприятия", ПараметрыСеанса.ДоступныеПредприятия); 
	Если ЭтотОбъект.Параметры.Отбор.Свойство("Владелец") Тогда
		КонтрагентОтбора = ЭтотОбъект.Параметры.Отбор.Владелец;
		Если ЗначениеЗаполнено(КонтрагентОтбора) И
			ТипЗнч(КонтрагентОтбора) = Тип("СправочникСсылка.Контрагенты") Тогда
			Если КонтрагентОтбора.ОрганизацияВГОВНХ И ЗначениеЗаполнено(КонтрагентОтбора.ЭтоОрганизация) Тогда   
				Параметры.ОрганизацияКонтрагента = КонтрагентОтбора.ЭтоОрганизация;
				Параметры.Контрагент = КонтрагентОтбора; 
				Если ЭтотОбъект.Параметры.Отбор.Свойство("Предприятие") Тогда
					Параметры.Предприятие = ЭтотОбъект.Параметры.Отбор.Предприятие;
				КонецЕсли;
				Параметры.ЗаполнятьОтборДляВНХ = Истина;
				ЭтотОбъект.Параметры.Отбор.Удалить("Владелец");
				Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса,
				"СправочникВнутренниеДоговоры.Предприятие В (&ДоступныеПредприятия)",
				"СправочникВнутренниеДоговоры.Предприятие В (&ДоступныеПредприятия) И (Выбор Когда &ОтборприСоздании = Истина Тогда
				|(СправочникВнутренниеДоговоры.Владелец = &Контрагент ИЛИ СправочникВнутренниеДоговоры.ОрганизацияВладельца = &ОрганизацияВладельца)
				|Иначе
				| Истина Конец)");
				Список.Параметры.УстановитьЗначениеПараметра("ОтборприСоздании", Истина); 
				Список.Параметры.УстановитьЗначениеПараметра("Контрагент", КонтрагентОтбора); 
				Список.Параметры.УстановитьЗначениеПараметра("ОрганизацияВладельца", КонтрагентОтбора.ЭтоОрганизация);
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Не Копирование Тогда
		Если Параметры.ЗаполнятьОтборДляВНХ Тогда 
			ПараметрыФормы = Новый Структура("Контрагент,ОрганизацияКонтрагента,Предприятие,ЗаполнятьОтборДляВНХ",Параметры.Контрагент,Параметры.ОрганизацияКонтрагента,Параметры.Предприятие,Параметры.ЗаполнятьОтборДляВНХ); 
			Отказ = Истина; 
			ОткрытьФорму("Справочник.ВнутренниеДоговоры.Форма.ФормаЭлемента",ПараметрыФормы); 
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры
